coocox/Mplib/Toshaba/TMPM36x/TMPM362/cmsis_lib/lib/include/tmpm362_cec.h
/**
 *******************************************************************************
 * @file    tmpm362_cec.h
 * @brief   This file provides all the functions prototypes for CEC driver.
 * @version V2.2.0
 * @date    2011/05/05
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2011 All rights reserved
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __TMPM362_CEC_H
#define __TMPM362_CEC_H
#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "TMPM362.h"
#include "tx03_common.h"

#if defined(__TMPM360_CEC_H) || defined(__TMPM361_CEC_H) || defined(__TMPM362_CEC_H) || \
    defined(__TMPM363_CEC_H) || defined(__TMPM364_CEC_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @addtogroup CEC
  * @{
  */

/** @addtogroup CEC_Exported_types
  * @{
  */
    typedef enum {
        CEC_TV = 0U,
        CEC_RECORDING_DEVICE_1 = 1U,
        CEC_RECORDING_DEVICE_2 = 2U,
        CEC_STB_1 = 3U,
        CEC_DVD_1 = 4U,
        CEC_AUDIO_SYSTEM = 5U,
        CEC_STB_2 = 6U,
        CEC_STB_3 = 7U,
        CEC_DVD_2 = 8U,
        CEC_RECORDING_DEVICE_3 = 9U,
        CEC_FREE_USE = 14U,
        CEC_BROADCAST = 15U,
        CEC_UNKNOWN = 16U
    } CEC_LogicalAddr;
#define IS_CEC_LOGICAL_ADDR(param)  (((param) == CEC_TV) || \
                                     ((param) == CEC_RECORDING_DEVICE_1) || \
                                     ((param) == CEC_RECORDING_DEVICE_2) || \
                                     ((param) == CEC_STB_1) || \
                                     ((param) == CEC_DVD_1) || \
                                     ((param) == CEC_AUDIO_SYSTEM) || \
                                     ((param) == CEC_STB_2) || \
                                     ((param) == CEC_STB_3) || \
                                     ((param) == CEC_DVD_2) || \
                                     ((param) == CEC_RECORDING_DEVICE_3) || \
                                     ((param) == CEC_FREE_USE) || \
                                     ((param) == CEC_BROADCAST))

    typedef enum {
        CEC_HIGH_CANCELLATION_1 = 0U,    /*!< 1 cycle */
        CEC_HIGH_CANCELLATION_2 = 1U,    /*!< 2 cycles */
        CEC_HIGH_CANCELLATION_3 = 2U,    /*!< 3 cycles */
        CEC_HIGH_CANCELLATION_4 = 3U,    /*!< 4 cycles */
    } CEC_HighCancellation;
#define IS_CEC_HIGH_CANCELLATION(param)    (((param) == CEC_HIGH_CANCELLATION_1) || \
                                            ((param) == CEC_HIGH_CANCELLATION_2) || \
                                            ((param) == CEC_HIGH_CANCELLATION_3) || \
                                            ((param) == CEC_HIGH_CANCELLATION_4))

    typedef enum {
        CEC_LOW_CANCELLATION_1 = 0U,     /*!< 1 cycle */
        CEC_LOW_CANCELLATION_2 = 1U,     /*!< 2 cycles */
        CEC_LOW_CANCELLATION_3 = 2U,     /*!< 3 cycles */
        CEC_LOW_CANCELLATION_4 = 3U,     /*!< 4 cycles */
        CEC_LOW_CANCELLATION_5 = 4U,     /*!< 5 cycles */
        CEC_LOW_CANCELLATION_6 = 5U,     /*!< 6 cycles */
        CEC_LOW_CANCELLATION_7 = 6U,     /*!< 7 cycles */
        CEC_LOW_CANCELLATION_8 = 7U      /*!< 8 cycles */
    } CEC_LowCancellation;
#define IS_CEC_LOW_CANCELLATION(param)    (((param) == CEC_LOW_CANCELLATION_1) || \
                                           ((param) == CEC_LOW_CANCELLATION_2) || \
                                           ((param) == CEC_LOW_CANCELLATION_3) || \
                                           ((param) == CEC_LOW_CANCELLATION_4) || \
                                           ((param) == CEC_LOW_CANCELLATION_5) || \
                                           ((param) == CEC_LOW_CANCELLATION_6) || \
                                           ((param) == CEC_LOW_CANCELLATION_7) || \
                                           ((param) == CEC_LOW_CANCELLATION_8))

    typedef enum {
        CEC_CYCLE_MIN_0 = 0U,    /*!< 2.05ms */
        CEC_CYCLE_MIN_1 = 1U,    /*!< 2.05ms+1cycle */
        CEC_CYCLE_MIN_2 = 2U,    /*!< 2.05ms+2cycles */
        CEC_CYCLE_MIN_3 = 3U,    /*!< 2.05ms+3cycles */
        CEC_CYCLE_MIN_4 = 4U,    /*!< 2.05ms-1cycle */
        CEC_CYCLE_MIN_5 = 5U,    /*!< 2.05ms-2cycles */
        CEC_CYCLE_MIN_6 = 6U,    /*!< 2.05ms-3cycles */
        CEC_CYCLE_MIN_7 = 7U     /*!< 2.05ms-4cycles */
    } CEC_CycleMin;
#define IS_CEC_CYCLE_MIN(param)    (((param) == CEC_CYCLE_MIN_0) || \
                                    ((param) == CEC_CYCLE_MIN_1) || \
                                    ((param) == CEC_CYCLE_MIN_2) || \
                                    ((param) == CEC_CYCLE_MIN_3) || \
                                    ((param) == CEC_CYCLE_MIN_4) || \
                                    ((param) == CEC_CYCLE_MIN_5) || \
                                    ((param) == CEC_CYCLE_MIN_6) || \
                                    ((param) == CEC_CYCLE_MIN_7))

